---
type: IDirectContext3DServer
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 7
tags: [revit-api, class]
---

# IDirectContext3DServer

`Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanExecute | 2018 | `bool CanExecute ( View dBView )` |
| Method | GetApplicationId | 2018 | `string GetApplicationId ()` |
| Method | GetBoundingBox | 2018 | `Outline GetBoundingBox ( View dBView )` |
| Method | GetSourceId | 2018 | `string GetSourceId ()` |
| Method | RenderScene | 2018 | `void RenderScene ( View dBView , DisplayStyle displayStyle )` |
| Method | UseInTransparentPass | 2018 | `bool UseInTransparentPass ( View dBView )` |
| Method | UsesHandles | 2018 | `bool UsesHandles ()` |